#include <stdio.h>

// 在C语言中，有三个函数可以用来在显示器上输出数据，它们分别是：puts,putchar,printf。printf()是最灵活、最复杂、最常用的输出函数，完全可以替代puts()和putchar()。
// %c 	            输出一个单一的字符
// %hd、%d、%ld 	以十进制、有符号的形式输出short、int、long类型的整数
// %hu、%u、%lu 	以十进制、无符号的形式输出short、int、long类型的整数
// %ho、%o、%lo 	以八进制、不带前缀、无符号的形式输出short、int、long类型的整数
// %#ho、%#o、%#lo 	以八进制、带前缀、无符号的形式输出short、int、long类型的整数
// %hx、%x、%lx     以十六进制、不带前缀、无符号的形式输出short、int、long类型的整数。
// %hX、%X、%lX 	如果x小写，那么输出的十六进制数字也小写；如果X大写，那么输出的十六进制数字也大写。
// %#hx、%#x、%#lx  以十六进制、带前缀、无符号的形式输出 short、int、long 类型的整数。
// %#hX、%#X、%#lX 	如果x小写，那么输出的十六进制数字和前缀都小写；如果X大写，那么输出的十六进制数字和前缀都大写。
// %f、%lf 	        以十进制的形式输出float、double类型的小数
// %e、%le          以指数的形式输出float、double类型的小数。
// %E、%lE 	        如果e小写，那么输出结果中的e也小写；如果E大写，那么输出结果中的E也大写。
// %g、%lg          以十进制和指数中较短的形式输出float、double类型的小数，并且小数部分的最后不会添加多余的0。
// %G、%lG 	        如果g小写，那么当以指数形式输出时e也小写；如果G大写，那么当以指数形式输出时E也大写。
// %s 	            输出一个字符串

int main() { return 0; }