package main

import (
	"fmt"
	"time"
)

// goroutine和channel,其支持“顺序通信进程”(communicating sequential processes)或被简称为CSP。
// CSP是一种现代的并发编程模型,在这种编程模型中值会在不同的运行实例(goroutine)中传递,尽管大多数情况下
// 仍然是被限制在单一实例中。
// 传统的并发模型:多线程共享内存

// 在Go语言中,每一个并发的执行单元叫作一个goroutine。

// 当一个程序启动时,其主函数即在一个单独的goroutine中运行,我们叫它main	goroutine。新
// 的goroutine会用go语句来创建。在语法上,go语句是一个普通的函数或方法调用前加上关键
// 字go。go语句会使其语句中的函数在一个新创建的goroutine中运行。而go语句本身会迅速地完成。

// 主函数返回时,所有的goroutine都会被直接打断,程序退出。除了从主函
// 数退出或者直接终止程序之外,没有其它的编程方法能够让一个goroutine来打断另一个的执
// 行,但是可以通过goroutine之间的通信来让一个goroutine请求其它的goroutine,
// 并让被请求的goroutine自行结束执行。

// 网络编程是并发大显身手的一个领域,由于服务器是最典型的需要同时处理很多连接的程
// 序,这些连接一般来自于彼此独立的客户端。

// net包提供编写一个网络客户端或者服务器程序的基本组件,无论两者间通信是使用TCP,UDP
// 或者Unix domain sockets。

// goroutine和线程：
// goroutine和操作系统的线程区别实际上只是一个量的区别,但量变会引起质变的道理同样适用于goroutine和线程。
// 动态栈:
// 每一个OS线程都有一个固定大小的内存块(一般会是2MB)来做栈,这个栈会用来存储当前正
// 在被调用或挂起(指在调用其它函数时)的函数的内部变量。这个固定大小的栈同时很大又很
// 小。因为2MB的栈对于一个小小的goroutine来说是很大的内存浪费,比如对于我们用到的,
// 一个只是用来WaitGroup之后关闭channel的goroutine来说。而对于go程序来说,同时创建成
// 百上千个goroutine是非常普遍的,如果每一个goroutine都需要这么大的栈的话,那这么多的
// goroutine就不太可能了。除去大小的问题之外,固定大小的栈对于更复杂或者更深层次的递
// 归函数调用来说显然是不够的。修改固定的大小可以提升空间的利用率允许创建更多的线
// 程,并且可以允许更深的递归调用,不过这两者是没法同时兼备的。
// 相反,一个goroutine会以一个很小的栈开始其生命周期,一般只需要2KB。一个goroutine的
// 栈,和操作系统线程一样,会保存其活跃或挂起的函数调用的本地变量,但是和OS线程不太
// 一样的是一个goroutine的栈大小并不是固定的;栈的大小会根据需要动态地伸缩。而
// goroutine的栈的最大值有1GB,比传统的固定大小的线程栈要大得多,尽管一般情况下,大
// 多goroutine都不需要这么大的栈。
// Goroutine调度:
// OS线程会被操作系统内核调度。每几毫秒,一个硬件计时器会中断处理器,这会调用一个叫
// 作scheduler的内核函数。这个函数会挂起当前执行的线程并保存内存中它的寄存器内容,检
// 查线程列表并决定下一次哪个线程可以被运行,并从内存中恢复该线程的寄存器信息,然后
// 恢复执行该线程的现场并开始执行线程。因为操作系统线程是被内核所调度,所以从一个线
// 程向另一个“移动”需要完整的上下文切换,也就是说,保存一个用户线程的状态到内存,恢复
// 另一个线程的到寄存器,然后更新调度器的数据结构。这几步操作很慢,因为其局部性很差
// 需要几次内存访问,并且会增加运行的cpu周期。
// Go的运行时包含了其自己的调度器,这个调度器使用了一些技术手段,比如m:n调度,因为
// 其会在n个操作系统线程上多工(调度)m个goroutine。Go调度器的工作和内核的调度是相似
// 的,但是这个调度器只关注单独的Go程序中的goroutine。和操作系统的线程调度不同的是,
// Go调度器并不是用一个硬件定时器而是被Go语言"建筑"本身进行调度的。例如当一个goroutine
// 调用了time.Sleep或者被channel调用或者mutex操作阻塞时,调度器会使其进入休眠并开始执
// 行另一个goroutine直到时机到了再去唤醒第一个goroutine。因为这种调度方式不需要进入内
// 核的上下文,所以重新调度一个goroutine比调度一个线程代价要低得多。
// GOMAXPROCS:
// Go的调度器使用了一个叫做GOMAXPROCS的变量来决定会有多少个操作系统的线程同时执
// 行Go的代码。其默认的值是运行机器上的CPU的核心数,所以在一个有8个核心的机器上
// 时,调度器一次会在8个OS线程上去调度GO代码。(GOMAXPROCS是前面说的m:n调度中的
// n)。在休眠中的或者在通信中被阻塞的goroutine是不需要一个对应的线程来做调度的。在I/O
// 中或系统调用中或调用非Go语言函数时,是需要一个对应的操作系统线程的,但是
// GOMAXPROCS并不需要将这几种情况计算在内。
// 你可以用GOMAXPROCS的环境变量来显式地控制这个参数,或者也可以在运行时用
// runtime.GOMAXPROCS函数来修改它。
// Goroutine没有ID号:
// 在大多数支持多线程的操作系统和程序语言中,当前的线程都有一个独特的身份(id),并且这
// 个身份信息可以以一个普通值的形式被被很容易地获取到,典型的可以是一个integer或者指
// 针值。这种情况下我们做一个抽象化的thread-local	storage(线程本地存储,多线程编程中不
// 希望其它线程访问的内容)就很容易,只需要以线程的id作为key的一个map就可以解决问题,
// 每一个线程以其id就能从中获取到值,且和其它线程互不冲突。
// goroutine没有可以被程序员获取到的身份(id)的概念。这一点是设计上故意而为之,由于
// thread-local	storage总是会被滥用。比如说,一个web	server是用一种支持tls的语言实现的,
// 而非常普遍的是很多函数会去寻找HTTP请求的信息,这代表它们就是去其存储层(这个存储
// 层有可能是tls)查找的。这就像是那些过分依赖全局变量的程序一样,会导致一种非健康的“距
// 离外行为”,在这种行为下,一个函数的行为可能不是由其自己内部的变量所决定,而是由其
// 所运行在的线程所决定。因此,如果线程本身的身份会改变——比如一些worker线程之类的
// ——那么函数的行为就会变得神秘莫测。
// Go鼓励更为简单的模式,这种模式下参数对函数的影响都是显式的。这样不仅使程序变得更
// 易读,而且会让我们自由地向一些给定的函数分配子任务时不用担心其身份信息影响行为。

func main() {
	go spinner(100 * time.Millisecond)
	const n = 45
	fibN := fib(n)                                // slow
	fmt.Printf("\rFibonacci(%d) = %d\n", n, fibN) // Fibonacci(45) = 1134903170
}
func spinner(delay time.Duration) {
	for {
		for _, r := range `-\|/` {
			fmt.Printf("\r%c", r)
			time.Sleep(delay)
		}
	}
}
func fib(x int) int {
	if x < 2 {
		return x
	}
	return fib(x-1) + fib(x-2)
}
